# 理解低碎片(LFH)堆

## 简介

Windows堆利用技术，伴随着越来越复杂的算法和数据结构，无论是利用方法的数量还是难度系数都在逐年递增。而这种趋势，加之社区内部对堆相关知识理解的浅显与匮乏，使得可靠的利用技术严重下滑。如果对堆管理机制的内部能有一个完整的理解，那么就可以避开那些不可预测的失败，写出精准的exp。

自Windows Vista以来，LFH已经成了Windows操作系统默认的前端堆管理器。相比较此前的Lookaside List，新的前端堆管理器引入了一套不同的数据结构与算法。同时，系统本身也改变了后端的内存管理机制。这些都对Windows 7应用程序分配和释放内存产生了影响。

本文的主要目的在于使读者可以熟悉新的创建逻辑以及与LFH相关的数据结构。首先，我们会阐释新的数据结构以及他们之间的耦合关系，谱写一些清晰简明的基础内容。此后会对底层算法如何操纵这些数据结构展开讨论。最后，我们会使用这些新的知识、通过具体的实例来揭秘一些新的利用技术。

###概览

本文分成4个独立的部分。第一部分详述了核心数据结构，它们贯穿了整个堆管理机制，维护内存。对这些结构有一个透彻的理解是深入理解本文其他部分内容的先决条件。

第二部分会讨论在Windows Vista和Windows 7上（移植过来）新的架构。这一部分会展示基于Windows XP代码而进化了的数据结构的使用。

第三部分将揭露Windows 7堆的核心算法的底层信息。这一部分会对前端和后端两个堆管理子系统进行详述。理解这一部分将有助于理解第四部分的框架与exp的开发。

第四部分，也是本文的最后一部分，将展示如何使用底层堆管理器，对堆进行精心操纵，通过用户提供的信息，滥改堆元数据以达成代码执行的一些战术。

###预前工作

尽管当前可能已经有非常多的LFH相关的信息，我还是仅仅列出我在做研究时所用到的一些资料。为了理解本文，这些资料理应被预先浏览。如果列表里落了谁，我对此表示抱歉。

- 我仍然确信Ben Hawkes在几年前就已经搞清楚这回事了。他在RuxCon/Blackhat 2008的演讲是我作品的灵感源泉。(Hawkes 2008)
- Nico Waisman对Windows Vista展开了大量的逆向工作，在Immunity Debugger中的libheap.py插件中提供了详细的信息。(Waisman 2008)
- Brett Moore的论文"Heaps about Heaps"是我认为所有看过的最精彩的演讲。我想它会永远作为堆相关工作的一个伟大的参考。(Moore 2007)
- Brett Moore还发表了在Windows XP SP2上FreeList[0]的链入过程利用手法，本文也会提及此手法。(Moore 2005)
- Richard Johnson在ToorCon 2006的演讲描述了Windows Vista的新生LFH。这是关于LFH算法和数据结构详细描述的第一份资料。(Johnson 2006)
- 尽管David B.Probert(Ph.D.)的演讲主要聚焦于LFH性能的表现，但对于试图理解在Windows 7上堆实现机制的变化来说这依然非常有价值。(Probet)
- Adrian Marinescu在Blackhat 2006上对Windows Vista的堆的变化进行了演讲。他清楚地解释了从旧堆管理机制到当下过渡的原因。(Marinescu 2006)
- 最后，Lionel d'Hauenens的Symbol Type Viewer是一个无价之宝，它可以分析Windows 7堆管理的数据结构。如果没有它，在寻找数据结构时定会浪费大量的时间。

###预备知识

本文所用的所有伪代码和数据结构都源于32位Windows 7的ntdll.dll，版本是6.1.7600.16385。利用Symbol Type Viewer和Windbg，从该库摘取的数据结构名称定义全部源于微软符号服务器。

伪代码的修改较多，以便于专注研究堆管理算法的核心部分。如果你觉着我落掉了某些内容或是解释的不正确，请与我邮件联系cvalasek@gamil.com。我会给你奖金。

###术语

关于Windows堆这一主题，当前已发表过多篇论文，不幸的是，我发现他们所用的术语各不相同。尽管本文使用的术语和其他人的也不一样，但我还是想现在对他们进行定义，以便在整篇文章中保持一致。

术语block或者blocks表示8字节连续内存。它是堆块(heap chunk)头部在引用大小时所用的最小度量单位。一个chunk是一片连续的内存空间，可以使用blocks或bytes来度量。

HeapBase是一个指向结构体`_HEAP`指针的别名，它由Windows调试符号定义。整篇文章中各种对象都会按HeapBase起始的某个偏移量进行定义。同时，LFH是Low Fragmentation Heap的缩写。

BlocksIndex是`_HEAP_LIST_LOOKUP`结构的别名。这两个术语可以相互替代。BlocksIndex结构体通过Lists来管理chunks，低于0x400（1024）字节的chunks所在的Lists作为第一个 BlocksIndex，而从0x400到0x4000(16k)的块所在的Lists作为第二个BlocksIndex。大于16k的且低于DeCommitThreshold和0xFE00 blocks的chunks会被组织在类似FreeList[0]的结构体中（在文章后面讨论）。

专用FreeLists的概念已经消失了。术语ListHint或FreeList用来表示指向Heap->FreeLists中特定位置的一个链表。这将在本文的架构部分进行展开。

最后，术语HeapBin, Bin, UserBlock用来表示LFH分配的一块具体大小的内存。我知道大部分人称之为HeapBucket，但是我一般不这样叫，这是为了避免与微软调试符号`_HEAP_BUCKET`产生混淆，`_HEAP_BUCKET`是一个0x4字节的数据结构，用来指定一个尺寸而不是用于内存容器。

###注意事项

本文旨在为John McDonald和我在Blackhat USA 2009完成的工作提供后续知识。关于双链表、Lookaside链表等结构的内部工作原理都可以在题为《Practical Windows XP/2003 Exploitation》一文中找到。

## 数据结构

所有的数据结构都源于ntdll.dll的Windows调试符号，版本是6.1.7600.16385。它们在堆管理器中用于追溯内存，通过抽象函数调用为用户提供访问虚拟内存的渠道，主要是通过`HeapAlloc()`,`HeapFree()`,`malloc()`和`free()`。

### _HEAP(HeapBase)

每个堆都以一个叫HeapBase的结构开始构建。HeapBase包含了堆管理器所用到的多个重要的值和结构体指针。它是每个堆的心脏，为了提供可靠的分配和释放操作，必须维持该结构的完整性。如果你对Windows XP的基础代码比较熟悉，那么它看起来是相当雷同的，但其中某些加粗的字段仍需进一步解释。下面展示了`_HEAP`结构体在32位Windows 7 Service Pack 0上的布局：

```
0:001> dt _HEAP 
ntdll!_HEAP 
  +0x000 Entry : _HEAP_ENTRY 
  +0x008 SegmentSignature : Uint4B 
  +0x00c SegmentFlags : Uint4B 
  +0x010 SegmentListEntry : _LIST_ENTRY 
  +0x018 Heap : Ptr32 _HEAP 
  +0x01c BaseAddress : Ptr32 Void 
  +0x020 NumberOfPages : Uint4B 
  +0x024 FirstEntry : Ptr32 _HEAP_ENTRY 
  +0x028 LastValidEntry : Ptr32 _HEAP_ENTRY 
  +0x02c NumberOfUnCommittedPages : Uint4B 
  +0x030 NumberOfUnCommittedRanges : Uint4B 
  +0x034 SegmentAllocatorBackTraceIndex : Uint2B 
  +0x036 Reserved : Uint2B 
  +0x038 UCRSegmentList : _LIST_ENTRY 
  +0x040 Flags : Uint4B 
  +0x044 ForceFlags : Uint4B
  +0x048 CompatibilityFlags : Uint4B 
  +0x04c EncodeFlagMask : Uint4B 	
  +0x050 Encoding : _HEAP_ENTRY 	
  +0x058 PointerKey : Uint4B 
  +0x05c Interceptor : Uint4B 
  +0x060 VirtualMemoryThreshold : Uint4B 
  +0x064 Signature : Uint4B 
  +0x068 SegmentReserve : Uint4B 
  +0x06c SegmentCommit : Uint4B 
  +0x070 DeCommitFreeBlockThreshold : Uint4B 
  +0x074 DeCommitTotalFreeThreshold : Uint4B 
  +0x078 TotalFreeSize : Uint4B 
  +0x07c MaximumAllocationSize : Uint4B 
  +0x080 ProcessHeapsListIndex : Uint2B 
  +0x082 HeaderValidateLength : Uint2B 
  +0x084 HeaderValidateCopy : Ptr32 Void 
  +0x088 NextAvailableTagIndex : Uint2B 
  +0x08a MaximumTagIndex : Uint2B 
  +0x08c TagEntries : Ptr32 _HEAP_TAG_ENTRY 
  +0x090 UCRList : _LIST_ENTRY 
  +0x098 AlignRound : Uint4B 
  +0x09c AlignMask : Uint4B 
  +0x0a0 VirtualAllocdBlocks : _LIST_ENTRY 
  +0x0a8 SegmentList : _LIST_ENTRY 
  +0x0b0 AllocatorBackTraceIndex : Uint2B 
  +0x0b4 NonDedicatedListLength : Uint4B 
  +0x0b8 BlocksIndex : Ptr32 Void 	
  +0x0bc UCRIndex : Ptr32 Void 
  +0x0c0 PseudoTagEntries : Ptr32 _HEAP_PSEUDO_TAG_ENTRY 
  +0x0c4 FreeLists : _LIST_ENTRY 	
  +0x0cc LockVariable : Ptr32 _HEAP_LOCK 
  +0x0d0 CommitRoutine : Ptr32 long 
  +0x0d4 FrontEndHeap : Ptr32 Void 	
  +0x0d8 FrontHeapLockCount : Uint2B 
  +0x0da FrontEndHeapType : UChar 	
  +0x0dc Counters : _HEAP_COUNTERS 
  +0x130 TuningParameters : _HEAP_TUNING_PARAMETERS
```

> 译者注：原文加粗的字段就是下面枚举解释的那些。

- `EncodeFlagMask` - 用于判断堆chunk头部是否被编码。该值初始化时由`RtlCreateHeap()`中的`RtlpCreateHeapEncoding()`设置为0x100000。
- `Encoding` - 在异或(XOR)操作中用于编码chunk头，防止可预知的元数据被污染。
- `BlocksIndex` - 这是个`_HEAP_LIST_LOOKUP`结构体，用途广泛。因为他比较重要，所以我们在文章的后面部分进行详细解释。
- `FreeLists` - 一个特殊的链表，包含了堆上所有空闲chunk的指针。基本上可以把它看成是个堆缓存，只不过对所有尺寸的chunk都适用（并且没有单一关联位图）。
- `FrontEndHeapType` - 初始化设置为0x0的整型数，随后会被赋予0x2的值，用于指示LFH的使用。注意：Windows 7实际上不支持Lookaside Lists。
- `FrontEndHeap` - 指向关联的前端堆。在Windows 7中，它要么是NULL要么是一个指向`_LFH_HEAP`结构体的指针。

### _HEAP_LIST_LOOKUP(HeapBase->BlocksIndex)

理解`_HEAP_LIST_LOOKUP`结构对于理解Windows 7堆管理机制来说非常重要。它是前端和后端堆管理器分配和释放机制的基石。在正常条件下，由`RtlCreateHeap()`初始化的第一个`_HEAP_LIST_LOOKUP`结构会分配在HeapBase+0x150处。

```
0:001> dt _HEAP_LIST_LOOKUP 
ntdll!_HEAP_LIST_LOOKUP 
  +0x000 ExtendedLookup : Ptr32 _HEAP_LIST_LOOKUP 
  +0x004 ArraySize : Uint4B 
  +0x008 ExtraItem : Uint4B 
  +0x00c ItemCount : Uint4B 
  +0x010 OutOfRangeItems : Uint4B 
  +0x014 BaseIndex : Uint4B 
  +0x018 ListHead : Ptr32 _LIST_ENTRY 
  +0x01c ListsInUseUlong : Ptr32 Uint4B 
  +0x020 ListHints : Ptr32 Ptr32 _LIST_ENTRY
```

- `ExtendedLookup` - 指向下一个`_HEAP_LIST_LOOKUP`结构体的指针，不存在下一个则为NULL。
- `ArraySize` - 该结构可以追溯的最大block尺寸，超出尺寸的就需要存储在一个特殊的`ListHint`中。Windows 7当前唯一使用的两个尺寸值是0x80和0x800。
- `OutOfRangeItems` - 该四字节值记载了类FreeList[0]结构中条目的个数。每个`_HEAP_LIST_LOOKUP`会通过`ListHint[ArraySize-BaseIndex-1]`来跟踪尺寸大于`ArraySize-1`的空闲chunks。
- `BaseIndex` - 用于索引`ListHints`数组的相对偏移，每个`_HEAP_LIST_LOOKUP`都被设计成对应于某一个具体尺寸。例如，第一个BlocksIndex的BaseIndex应该是0x0，因为它管理的chunks大小范围在0x0-0x80之间，而第二个BlocksIndex的BaseIndex应该是0x80。
- `ListHead` - 它和`HeapBase->FreeLists`指向同一个位置，该位置是一个链表，存储了堆中可用的所有的空闲chunks。
- `ListsInUseUlong` - 形式上作为`FreeListInUseBitmap`，该4字节整型数是一种优化，用于判断哪个`ListHints`拥有可用的chunks。
- `ListHints` - 也视为`FreeLists`，这些链表提供了内存中空闲chunks的指针，与此同时还用于其它目的。如果对一个给定的`Bucket`尺寸启用LFH，那么特定尺寸的`ListHint/FreeList`的`blink`将指向`_HEAP_BUCKET+1`。

### _LFH_HEAP(HeapBase->FrontEndHeap)

LFH由该数据结构管理。当激活时，它会告知堆管理器它可以管理何种尺寸，同时对此前用过的chunks保持缓存。尽管`BlocksIndex`足以追溯尺寸上超过0x800 blocks的chunks，但LFH仅仅为尺寸小于16k的chunks所用。

```
0:001> dt _LFH_HEAP 
ntdll!_LFH_HEAP 
  +0x000 Lock : _RTL_CRITICAL_SECTION 
  +0x018 SubSegmentZones : _LIST_ENTRY 
  +0x020 ZoneBlockSize : Uint4B 
  +0x024 Heap : Ptr32 Void 
  +0x028 SegmentChange : Uint4B 
  +0x02c SegmentCreate : Uint4B 
  +0x030 SegmentInsertInFree : Uint4B 
  +0x034 SegmentDelete : Uint4B 
  +0x038 CacheAllocs : Uint4B 
  +0x03c CacheFrees : Uint4B 
  +0x040 SizeInCache : Uint4B 
  +0x048 RunInfo : _HEAP_BUCKET_RUN_INFO 
  +0x050 UserBlockCache : [12] _USER_MEMORY_CACHE_ENTRY 
  +0x110 Buckets : [128] _HEAP_BUCKET 
  +0x310 LocalData : [1] _HEAP_LOCAL_DATA
```

- `Heap` - 该LFH指向父亲堆的指针
- `UserBlockCache` - 尽管不会详尽讨论该字段，但也值得提及。`UserBlockCache`数组跟踪了那些此前用过的内存chunks，这对未来的分配有用。
- `Buckets` - 0x4字节的数据结构数组，仅仅用于跟踪索引和尺寸。这就是为什么术语`Bin`会被用来描述满足特定`Bucket`请求的内存空间。
- `LocalData` - 指向一个大数据结构的指针，该数据结构保存了每个`SubSegment`的信息。可以参考`_HEAP_LOCAL_DATA`来了解更多信息。

### _LFH_BLOCK_ZONE(HeapBase->FrontEndHeap->LocalData->CrtZone)

该数据结构用于跟踪那些用于服务分配请求的内存的位置。这些指针在第一次服务请求时或者当指针链表用尽时被LFH设置。

```
0:000> dt _LFH_BLOCK_ZONE 
ntdll!_LFH_BLOCK_ZONE 
  +0x000 ListEntry : _LIST_ENTRY 
  +0x008 FreePointer : Ptr32 Void 
  +0x00c Limit : Ptr32 Void
```

- `ListEntry` - `_LFH_BLOCK_ZONE`结构链表
- `FreePointer` - 一个指向可以被`_HEAP_SUBSEGMENT`使用的内存指针
- `Limit` - 链表中最后一个`LFH_BLOCK_ZONE`结构。当该值达到临界时，后端堆会创建更多的`_LFH_BLOCK_ZONE`机构。

### _HEAP_LOCAL_DATA(HeapBase->FrontEndHeap->LocalData)

为LFH提供`_HEAP_LOCAL_SEGMENT_INFO`实例的关键数据结构。

```
0:000> dt _HEAP_LOCAL_DATA 
ntdll!_HEAP_LOCAL_DATA 
  +0x000 DeletedSubSegments : _SLIST_HEADER 
  +0x008 CrtZone : Ptr32 _LFH_BLOCK_ZONE 
  +0x00c LowFragHeap : Ptr32 _LFH_HEAP 
  +0x010 Sequence : Uint4B 
  +0x018 SegmentInfo : [128] _HEAP_LOCAL_SEGMENT_INFO
```

- `LowFragHeap` - 此结构关联的LFH。
- `SegmentInfo` - `_HEAP_LOCAL_SEGMENT_INFO`结构数组，代表LFH所有可用的尺寸。更多信息请参考`_HEAP_LOCAL_SEGMENT_INFO`。

### _HEAP_LOCAL_SEGMENT_INFO(HeapBase->FrontEndHeap->LocalData->SegmentInfo[])

所请求的尺寸将决定使用哪一个`_HEAP_LOCAL_SEGMENT_IOFO`结构。该结构控制了堆算法决定最有效的方式来分配和释放内存的信息。尽管`_HEAP_LOCAL_DATA`中只有128个该结构，所有的小于16k的8字节对齐尺寸都有一个对应的`_HEAP_LOCAL_SEGMENT_INFO`。有一个特殊的算法用于计算相对索引，以保证每个`Bucket`都有一个专门的结构。

```
0:000> dt _HEAP_LOCAL_SEGMENT_INFO 
ntdll!_HEAP_LOCAL_SEGMENT_INFO 
  +0x000 Hint : Ptr32 _HEAP_SUBSEGMENT 
  +0x004 ActiveSubsegment : Ptr32 _HEAP_SUBSEGMENT 
  +0x008 CachedItems : [16] Ptr32 _HEAP_SUBSEGMENT 
  +0x048 SListHeader : _SLIST_HEADER 
  +0x050 Counters : _HEAP_BUCKET_COUNTERS 
  +0x058 LocalData : Ptr32 _HEAP_LOCAL_DATA 
  +0x05c LastOpSequence : Uint4B 
  +0x060 BucketIndex : Uint2B 
  +0x062 LastUsed : Uint2B
```

- `Hint` - 该`Subsegment`仅在LFH释放了一个chunk时才设置。如果没有chunk被释放过，该值将始终是NULL。
- `ActiveSubsegment` - 为大部分内存请求所用的`SubSegment`。初始化为NULL，当为某个特定尺寸进行第一次分配时设置。
- `LocalData` - 体与此字段关联的`_HEAP_LOCAL_DATA`结构。
- `BucketIndex` - 每个`SegmentInfo`对象都与一个具体的`Bucket`尺寸(或索引)相关。

### _HEAP_SUBSEGMENT(HeapBase->FrontEndHeap->LocalData->SegmentInfo[]->Hint, ActiveSubsegment, CachedItems)

每个特定的`_HEAP_BUCKET`有着合适的结构来标识，前端管理器也因此可以执行释放或分配。既然LFH可以被视为一个堆管理器中的堆管理器，那么`_HEAP_SUBSEGMENT`用于跟踪有多少内存可用以及应该如何分布就很有意义了。

```
0:000> dt _HEAP_SUBSEGMENT 
ntdll!_HEAP_SUBSEGMENT 
  +0x000 LocalInfo : Ptr32 _HEAP_LOCAL_SEGMENT_INFO
  +0x004 UserBlocks : Ptr32 _HEAP_USERDATA_HEADER 
  +0x008 AggregateExchg : _INTERLOCK_SEQ 
  +0x010 BlockSize : Uint2B 
  +0x012 Flags : Uint2B 
  +0x014 BlockCount : Uint2B 
  +0x016 SizeIndex : UChar 
  +0x017 AffinityIndex : UChar 
  +0x010 Alignment : [2] Uint4B 
  +0x018 SFreeListEntry : _SINGLE_LIST_ENTRY 
  +0x01c Lock : Uint4B
```

- `LocalInfo` - 与此关联的`_HEAP_LOCAL_SEGMENT_INFO`结构
- `UserBlocks` - `_HEAP_USERDATA_HEADER`结构与此`SubSegment`耦合，它控制了一个大的内存chunk，该chunk被分割成n个chunks。
- `AggregateExchg` - `_INTERLOCK_SEQ`结构体，用于追溯当前的`Offset`和`Depth`。
- `SizeIndex` - 该`SubSegment`的`_HEAP_BUCKET SizeIndex`。

### _HEAP_USERDATA_HEADER(HeapBase->FrontEndHeap->LocalData->SegmentInfo[]->Hint, ActiveSubsegment, CachedItems->UserBlocks)

在UserBlock chunk之前的该头用于服务LFH所有的请求。当定位到一个`SubSegment`后，已提交(committed)内存实际上操纵的位置就是该结构。

```
0:000> dt _HEAP_USERDATA_HEADER 
ntdll!_HEAP_USERDATA_HEADER 
  +0x000 SFreeListEntry : _SINGLE_LIST_ENTRY 
  +0x000 SubSegment : Ptr32 _HEAP_SUBSEGMENT 
  +0x004 Reserved : Ptr32 Void 
  +0x008 SizeIndex : Uint4B 
  +0x00c Signature : Uint4
```

###_INTERLOCK_SEQ(HeapBase->FrontEndHeap->LocalData->SegmentInfo[]->Hint, ActiveSubsegment, CachedItems->AggregateExchg)

因为`UserBlock` chunks被划分的方式，我们需要某种方式来获取当前的偏移来释放或分配下一个chunk。该过程由`_INTERLOCK_SEQ`数据结构控制。

```
0:000> dt _INTERLOCK_SEQ 
ntdll!_INTERLOCK_SEQ 
  +0x000 Depth : Uint2B 
  +0x002 FreeEntryOffset : Uint2B 
  +0x000 OffsetAndDepth : Uint4B 
  +0x004 Sequence : Uint4B 
  +0x000 Exchg : Int8B
```

- `Depth` - 记录在`UserBlock`中剩余多少个chunks。释放时该值会递增，分配时则递减。它的初始值由`UserBlock/HeapBucket`决定。
- `FreeEntryOffset` - 该双字节整型数 * 0x8，加上`_HEAP_USERDATA_HEADER`的地址，就是下一个释放或分配内存的指针。该值以blocks(0x8字节chunks)为单位，初始化为0x2，这是因为`sizeof(_HEAP_USERDATA_HEADER)`等于0x10。(头部占两个blocks 0x2 * 0x8 == 0x10)
- `OffsetAndDepth` - 因为`Depth`和`FreeEntryOffset`都是双字节，所以它们可以组合形成一个单一四字节值。(译者注：注意这是个union)

###_HEAP_ENTRY(Chunk Header)

`_HEAP_ENTRY`就是堆chunk的头部，它是一个8字节的值，存储于每个chunk内存空间的起始位置（即使是`UserBlocks`内部的chunks也一样）。因为头部的有效性和安全性问题，自Windows XP基础代码以来该结构的改变巨大。

```
0:001> dt _HEAP_ENTRY 
ntdll!_HEAP_ENTRY 
  +0x000 Size : Uint2B 
  +0x002 Flags : UChar 
  +0x003 SmallTagIndex : Uchar 
  +0x000 SubSegmentCode : Ptr32 Void 
  +0x004 PreviousSize : Uint2B 
  +0x006 SegmentOffset : Uchar 
  +0x006 LFHFlags : Uchar 
  +0x007 UnusedBytes : Uchar 
  +0x000 FunctionIndex : Uint2B 
  +0x002 ContextValue : Uint2B 
  +0x000 InterceptorValue : Uint4B 
  +0x004 UnusedBytesLength : Uint2B 
  +0x006 EntryOffset : Uchar 
  +0x007 ExtendedBlockSignature : Uchar
```

- `Size` - chunk的尺寸，单位为blocks。它包括`_HEAP_ENTRY`本身的大小。
- `Flags` - 指示chunk的状态。比如FREE或BUSY。
- `SmallTagIndex` - 该值存储`_HEAP_ENTRY`前三个字节的XOR校验值。
- `UnusedBytes/ExtendedBlockSignature` - 表示未使用字节数，或是一个被LFH所管理的指示chunk状态的字节。

###概览

![](20180901_1.jpg)

## 架构

Windows 7堆管理器自Windows XP以来变化非常巨大，因此重温一些简洁的架构调整将很有必要。特别的，FreeLists工作的方式进行了重构，数据是如何存储于其中也需要进一步解释。

### FreeLists

在我们讨论核心算法之前，需要先调查当下和此前的FreeList结构。这是因为FreeLists操作与存储数据的方式自Windows XP基础代码以来发生了改变。John McDonald和我曾在此前的一篇论文中给出FreeList结构的概要：

> 对1024字节以下的块尺寸来说，每个尺寸都有一个链表，一共是128个空闲链表（堆块尺寸是8的倍数）。每个双向空闲链表都有一个哨兵头结点，存储于堆基址处某偏移的数组中。每个头结点包含两个指针：一个前向指针(Flink)，和一个后向指针(Blink)。FreeList[1]没有被用到，FreeList[2]-FreeList[127]被称作专用的空闲链表。每个链表中所有的空闲块大小都相同，大小应该是数组索引*8。所有大于等于1024字节的块，都被保存在FreeList[0]中（该槽是可用的，因为不存在大小为0的空闲块）。该链表的空闲块按升序排列。因此，FreeList[0].Flink指向最小的块(size>=1024)，而FreeList[0].Blink指向最大的块(size>=1024)。

![](20180901_2.jpg)

